Revit 2027 API
Document.NewSpotCoordinate Method
 Generate a new spot coordinate object within the project.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpotDimension NewSpotCoordinate(
	View view,
	Reference reference,
	XYZ origin,
	XYZ bend,
	XYZ end,
	XYZ refPt,
	bool hasLeader
)
Public Function NewSpotCoordinate (
	view As View,
	reference As Reference,
	origin As XYZ,
	bend As XYZ,
	end As XYZ,
	refPt As XYZ,
	hasLeader As Boolean
) As SpotDimension
public:
SpotDimension^ NewSpotCoordinate(
	View^ view,
	Reference^ reference,
	XYZ^ origin,
	XYZ^ bend,
	XYZ^ end,
	XYZ^ refPt,
	bool hasLeader
)
member NewSpotCoordinate :
        view : View *
        reference : Reference *
        origin : XYZ *
        bend : XYZ *
        end : XYZ *
        refPt : XYZ *
        hasLeader : bool -> SpotDimension
Parameters
view View
 The view in which the spot coordinate is to be visible.
reference Reference
 The reference to which the spot coordinate is to be bound.
origin XYZ
 The point which the spot coordinate evaluate.
bend XYZ
 The bend point for the spot coordinate.
end XYZ
 The end point for the spot coordinate.
refPt XYZ
 The actual point on the reference which the spot coordinate evaluate.
hasLeader Boolean
 Indicate if it has leader or not.
Return Value
SpotDimension
 If successful a new spot dimension object, otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown if the view does not exist in the given document.
Remarks
 If the origin point is not on the reference, it'll be projected to the reference automatically. And the refPt is projected point. If the reference is not valid or the point cannot be projected to reference correctly, an exception will be thrown
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace